% ======================================== SP_BVP_Initialize_Variables ===================================
% Main_BVP_Calcuで使用
% 使用する大半の変数を初期化(定義)する
%  
%
% 作成者      :2021/2/21 竹田 賢矢
% 最終更新者  :2021/2/26 竹田 賢矢
% =======================================================================================================
%% === BVPで利用する変数初期化 ===
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
if exist('ALL_BVP_Trajectories','var')==0
ALL_BVP_Trajectories=cell(0,5);
ALL_BVP_Trajectories(1,1:5)=[{'解軌道'},{'初期条件'},{'終端条件'},{'Ham'},{'Index'}];
end
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
if exist('sh_risou','var')==0
sh_risou=[];
end
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
if exist('sh_Base','var')==0
sh_Base=[];
end
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
if exist('Sxint2_2','var')==0
Sxint2_2=[];
end
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
if exist('mfold','var')==0
mfold=[];
end
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
if exist('Manifold','var')==0
Manifold=cell(1,1);
end
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%% === フラグ変数などの初期化 ===
global Bdim
Trajectory_Num=[];
BVP_trajectry=[];
Bdim=length(B(1,:));
BC1_p=Initial_State;
BC2_p=zeros(1,dim);
errorflag=0;
Tnum=0;
sh_use=0;
sh_useB=0;
m_use=0;
ch_B1=0;
ch_B2=0;
chB=0;
chB2=0;
ch_BS1=0;
ch_BS2=0;
DelCell=0;
Length_BVP_ALL_T=0;
i_B=0;
i_store=0;
i_plot=0;
PlotSxint=0;