function du = g(x)
% ======================================================================
% du = g(x)                                                             
%                                                                       
% システムの方程式の記述                                                
%                                                                       
% dot(x) = f(x) + g(x) * u                                              
%                                                                       
% システムの次元数分のxおよびpを与える。                                
% 与えられたシステムの方程式のうち、g(x)を入力する。                    
%                                                                       
% ======================================================================
global aa1 aa2 aa3 n Kdc
% global m1 m2 L1 L2 Lc1 Lc2 J1 J2 g0 mu2 n Kdc

x1 = x(1);
x2 = x(2);
x3 = x(3);
x4 = x(4);


du = [0; 0; -(aa3 * cos(x2) - aa2) / (cos(x2) ^ 2 * aa3 ^ 2 - aa1 * aa2) * n * Kdc; (0.2e1 * aa3 * cos(x2) - aa1 - aa2) / (cos(x2) ^ 2 * aa3 ^ 2 - aa1 * aa2) * n * Kdc;];
